<img style="float: left;;" src='../Figures/iteso.jpg' width="50" height="100"/></a>

# <center> <font color= #000047> Repaso de la Librería Pandas</font> </center>

# Groupby

El método groupby nos permite agrupar filas de datos y utilizar funciones de agregación

In [1]:
import pandas as pd
import numpy as np

In [3]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person':['Sam','Charly','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,243,350,124]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG   Charly    120
2    MSFT      Amy    340
3    MSFT  Vanessa    243
4      FB     Carl    350
5      FB    Sarah    124

<strong>Ahora podemos utilizar el método .groupby () para agrupar filas en función del nombre de una columna. <br> Por ejemplo, agrupemos según la empresa. Esto creará un objeto DataFrameGroupBy:</strong>

In [4]:
by_comp = df.groupby('Company')
by_comp

podemos guardar este objeto en una nueva variable:

In [5]:
by_comp.mean()

         Sales
Company
FB       237.0
GOOG     160.0
MSFT     291.5

Y luego podemos utilizar algún metodo de agregación.

In [8]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG   Charly    120
2    MSFT      Amy    340
3    MSFT  Vanessa    243
4      FB     Carl    350
5      FB    Sarah    124

In [7]:
df_max = by_comp.max()
df_max

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [9]:
df_max['Sales']

Company
FB      350
GOOG    200
MSFT    340
Name: Sales, dtype: int64

In [10]:
df_max['Sales'].max()

350

In [11]:
df[df['Sales']==df_max['Sales'].max()]

  Company Person  Sales
4      FB   Carl    350

In [12]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG   Charly    120
2    MSFT      Amy    340
3    MSFT  Vanessa    243
4      FB     Carl    350
5      FB    Sarah    124